In [2]:
import pandas as pd
import numpy as np

    Q - Loading the Dataset?

In [3]:
data = pd.read_csv("Forbes Billionaire 2020.csv")

    Q- print the top 3 of column of the dataset?

In [5]:
data.head(3)

,Name,NetWorth in billions,Country,Source,Rank,Age,Industry
0,Jeff Bezos,177.0,United States,Amazon,1,57,Technology
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49,Automotive
2,Bernard Arnault & family,150.0,France,LVMH,3,72,Fashion & Retail

     Q- print the Last 3 of column of the dataset?

In [6]:
data.tail(3)

,Name,NetWorth in billions,Country,Source,Rank,Age,Industry
2752,Zhao Meiguang,1.0,China,gold mining,2674,58,Metals & Mining
2753,Zhong Naixiong,1.0,China,conglomerate,2674,58,Diversified
2754,Zhou Wei family,1.0,China,Software,2674,54,Technology

    Q - Shape of the dataset?

In [6]:
data.shape

(2755, 7)

    print the column name?

In [13]:
data.columns

Index(['Name', 'NetWorth in billions', 'Country', 'Source', 'Rank', 'Age',
       'Industry'],
      dtype='object')

    Q - What is the maximum age of the billioners

In [4]:
data['Age'].max()

97

    Q - print the name of the billioners who is having the age 97

In [5]:
data["Name"][data['Age']==97]

170        Robert Kuok
1559     David Murdock
1626    Charles Munger
Name: Name, dtype: object

    Q print the statistical representation of the Age column?

In [7]:
data['Age'].describe()

count    2755.000000
mean       63.014519
std        13.259017
min        18.000000
25%        54.000000
50%        62.000000
75%        72.000000
max        97.000000
Name: Age, dtype: float64

    print the count of country column having the values

In [11]:
data["Country"].value_counts()

United States    724
China            626
India            140
Germany          136
Russia           118
                ...
Zimbabwe           1
Algeria            1
Venezuela          1
Tanzania           1
Liechtenstein      1
Name: Country, Length: 70, dtype: int64

    print the name which is having the country "india"

In [12]:
data['Name'][data["Country"]=='India']

9               Mukesh Ambani
23      Gautam Adani & family
71                 Shiv Nadar
116        Radhakishan Damani
122                Uday Kotak
                ...
2683         Ramesh Kumar Dua
2698            Ashok Kajaria
2699        T.S. Kalyanaraman
2712            Rafique Malik
2715           Mofatraj Munot
Name: Name, Length: 140, dtype: object

    print the name column?

In [15]:
data.Name

0                     Jeff Bezos
1                      Elon Musk
2       Bernard Arnault & family
3                     Bill Gates
4                Mark Zuckerberg
                  ...
2750           Daniel Yong Zhang
2751               Zhang Yuqiang
2752               Zhao Meiguang
2753              Zhong Naixiong
2754             Zhou Wei family
Name: Name, Length: 2755, dtype: object

    - another way bto print the Age column

In [17]:
data['Age']

0       57
1       49
2       72
3       65
4       36
        ..
2750    49
2751    65
2752    58
2753    58
2754    54
Name: Age, Length: 2755, dtype: int64

In [18]:
data['Country']

0       United States
1       United States
2              France
3       United States
4       United States
            ...
2750            China
2751            China
2752            China
2753            China
2754            China
Name: Country, Length: 2755, dtype: object

     print the both name and age column?

In [16]:
data[['Name','Age']]

                          Name  Age
0                   Jeff Bezos   57
1                    Elon Musk   49
2     Bernard Arnault & family   72
3                   Bill Gates   65
4              Mark Zuckerberg   36
...                        ...  ...
2750         Daniel Yong Zhang   49
2751             Zhang Yuqiang   65
2752             Zhao Meiguang   58
2753            Zhong Naixiong   58
2754           Zhou Wei family   54

[2755 rows x 2 columns]

    Checking the null value present insdie the Dataset?

In [23]:
data.isnull()

       Name  NetWorth in billions  Country  Source   Rank    Age  Industry
0     False                 False    False   False  False  False     False
1     False                 False    False   False  False  False     False
2     False                 False    False   False  False  False     False
3     False                 False    False   False  False  False     False
4     False                 False    False   False  False  False     False
...     ...                   ...      ...     ...    ...    ...       ...
2750  False                 False    False   False  False  False     False
2751  False                 False    False   False  False  False     False
2752  False                 False    False   False  False  False     False
2753  False                 False    False   False  False  False     False
2754  False                 False    False   False  False  False     False

[2755 rows x 7 columns]

    Checking the missing value inside the data?

In [26]:
data.isnull().sum()

Name                    0
NetWorth in billions    0
Country                 0
Source                  0
Rank                    0
Age                     0
Industry                0
dtype: int64